# 판다스 기초를 배워보자

In [30]:
# import pandas
import pandas as pd

## Series
1개 컬럼 값으로 구성된 1차원 데이터 셋

In [31]:
data = ["A", "B", "C","D"]
se = pd.Series(data)
se

0    A
1    B
2    C
3    D
dtype: object

In [32]:
se.index  # 0에서 시작해서, 4개가 있고, 1씩 커진다

RangeIndex(start=0, stop=4, step=1)

In [33]:
se.values

array(['A', 'B', 'C', 'D'], dtype=object)

In [34]:
# indexing
print(se[1])
print(se[3])

B
D

In [35]:
# slicing
print(se[:3])
print(se[0:3]) # 위와 동일
print(se[:])  # 전체 다 가져옴

0    A
1    B
2    C
dtype: object
0    A
1    B
2    C
dtype: object
0    A
1    B
2    C
3    D
dtype: object

In [36]:
# 컬럼 이름 변경
se.name = "alphabet"
se

0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [37]:
# 인덱스 이름 설정
se.index.name = "No."
se

No.
0    A
1    B
2    C
3    D
Name: alphabet, dtype: object

In [38]:
# Series 생성 시 index 지정하기
data = ["A", "B", "C","D"]

se = pd.Series(data, index=['a','b','c','d'])
se

a    A
b    B
c    C
d    D
dtype: object

In [39]:
se['a']  # index 값으로 가져오기

'A'

In [40]:
data = ["A","B","C","D"]
se = pd.Series(data)
se

0    A
1    B
2    C
3    D
dtype: object

In [41]:
# Series 생성 이후 index 지정하기 (덮어쓰기)
se.index=[1,2,3,4]
se

1    A
2    B
3    C
4    D
dtype: object

In [42]:
se > 40

TypeError: '>' not supported between instances of 'str' and 'int'

# DataFrame

In [43]:
import numpy as np

data = np.array([[1,2,3], [4,5,6], [7,8,9]])
column = ['D','E','F']

df = pd.DataFrame(data=data, index =['A','B','C'], columns=column)
df

# df = pd.read_csv('./filename.csv')

   D  E  F
A  1  2  3
B  4  5  6
C  7  8  9

In [69]:
# DataFrame 생성

data = {
    'country': ["kor", "usa", "china", "japan"],
    'rank': [1,2,3,4],
    'grade': ["A","B","C","D"]
}

# print(data)
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [70]:
# (1) DataFrame 생성시 인덱스 지정
df = pd.DataFrame(data, index = ["A","B","C","D"])
df

  country  rank grade
A     kor     1     A
B     usa     2     B
C   china     3     C
D   japan     4     D

In [71]:
# (2) df.index로 인덱스 지정
df.index = ["A","B","C","D"]
df  # -> 여기서는 index명이 없었다

  country  rank grade
A     kor     1     A
B     usa     2     B
C   china     3     C
D   japan     4     D

In [72]:
# (3) df.set_index로 인덱스 지정
df = df.set_index('grade')  
# df = df.set_index(['grade','rank','country'])  # index 여러개 지정 가능
df

      country  rank
grade
A         kor     1
B         usa     2
C       china     3
D       japan     4

## 데이터 셀렉션
DataFrame에서 값을 불러오는 방법
1. [ ]
    - df.컬럼, df.['컬럼'], df[1:3]

2. loc[인덱스명, 컬럼명]  # 사람이 읽을 수 있음

3. iloc[인덱스, 컬럼인덱스]  #위치 기반 인덱싱

In [73]:
# DataFrame 생성

data = {
    'country': ["kor", "usa", "china", "japan"],
    'rank': [1,2,3,4],
    'grade': ["A","B","C","D"]
}

# print(data)
df = pd.DataFrame(data)
df

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C
3   japan     4     D

In [78]:
# (1) df.컬럼, df['컬럼']

## 하나의 컬럼 조회
df.country

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

In [81]:
print(df['country'])
df[['country']]  # 원래는 이렇게 생긴건데 하나니까 위에처럼 [] 생략해주는 것임

0      kor
1      usa
2    china
3    japan
Name: country, dtype: object

  country
0     kor
1     usa
2   china
3   japan

In [82]:
## 둘 이상의 컬럼 조회
print(df[['country', 'grade']])  # 두개 가지고 오고 싶으면

  country grade
0     kor     A
1     usa     B
2   china     C
3   japan     D

In [86]:
# (2) loc[인덱스명, 컬럼명]

## 인덱스 값이 0인 행 조회
df.loc[0]

country    kor
rank         1
grade        A
Name: 0, dtype: object

In [87]:
## 2개 이상의 행 조회
df.loc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B
2   china     3     C

In [91]:
print(df.loc[[0,2]]) # 인덱스 값 0,2 행 가져오기

# df.loc[[0,2,4,6,8,10]] # 짝수만 가져오려면, 인덱스 값 가져와서 뽑으면 됨

  country  rank grade
0     kor     1     A
2   china     3     C

In [92]:
df.loc[0, 'grade'] # [행, 열]의 좌표 -> gks wnf rkwudhrl

'A'

In [94]:
df.loc[0:2, ['country', 'grade']]  # 0행 ~ 2행 범위 지정 가능, 원하는 데이터 country, grade만 가져와

  country grade
0     kor     A
1     usa     B
2   china     C

In [98]:
df['grade']=="A"

0     True
1    False
2    False
3    False
Name: grade, dtype: bool

In [100]:
df.loc[(df['grade']=="A")]

  country  rank grade
0     kor     1     A

In [101]:
df['rank'] > 2

0    False
1    False
2     True
3     True
Name: rank, dtype: bool

In [102]:
df.loc[df['rank'] > 2]

  country  rank grade
2   china     3     C
3   japan     4     D

In [104]:
df.loc[(df['grade']=="A") | (df['rank'] > 2)]

  country  rank grade
0     kor     1     A
2   china     3     C
3   japan     4     D

In [105]:
df.iloc[0:2]

  country  rank grade
0     kor     1     A
1     usa     2     B

## QUIZ